load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 4
      name: "Steady load test"
scenarios:
  - flow:
      - post:
          url: "/api/v1/notifications"
          json:
            type: "email"
            recipient: "user@example.com"
            message: "Test Load Notification"
            campaign_id: "123e4567-e89b-12d3-a456-426614174000"